AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/Propeller/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 83333.33333333334;

boundaryField
{
    // Foundation:
    
    nonConformalCyclic_on_MeshRefinement_M 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_M
    {
        type    nonConformalError;
    }

    nonConformalCyclic_on_MeshRefinement_S 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_S
    {
        type    nonConformalError;
    }


    MeshRefinement_M 
    {
        #include "MMR/scalar";
    }
    MeshRefinement_S 
    {
        #include "MMR/scalar";
    }


    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        totalPressure;
        p0          uniform 83333.33333333334;
        value       $internalField;
    }

    wall
    {
        type        zeroGradient;
    }

    wall001
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
