AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/Propeller/case/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// OpenCFD:

dynamicFvMesh dynamicMultiMotionSolverFvMesh;
dynamicMultiMotionSolverFvMeshCoeffs
{
    MeshRefinement
    {
        solver solidBody;
        cellZone MeshRefinement;
        solidBodyCoeffs
        {
    	    solidBodyMotionFunction  rotatingMotion;
            rotatingMotionCoeffs
            {
                origin (0.0 0.0 0.0);
                axis (0.0 0.0 1.0);
                omega 2.0;
            }
        }
    }    	
}

// Foundation:

mover
{
    type            motionSolver;
    libs            ("libfvMotionSolvers.so");
    motionSolver    motionSolverList;
    solvers
    {
        MeshRefinement
        {
            motionSolver solidBody;
            cellZone MeshRefinement;
            solidBodyMotionFunction rotatingMotion;
            origin (0.0 0.0 0.0);
            axis (0.0 0.0 1.0);
            omega 19.0 [rpm];
        }
    }
}
//************************************************************************ //
